uhnp/src/InformationRegisters/СодержаниеКорректировокПланаПроизводства/СодержаниеКорректировокПланаПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СодержаниеКорректировокПланаПроизводства</name>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПотребностиОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПотребностиДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаданИнтервалПотребности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИсходнаяПотребность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходнаяПотребностьКЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвторКорректировки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКорректировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПланПроизводства</name>
    <type>
      <types>DocumentRef.ПланПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыпускаПолуфабриката</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СодержаниеКорректировокПланаПроизводства/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет в очередь задание к корректировке плана производства полуфабрикатов.
//
// Параметры:
//  ПланПроизводства - ДокументСсылка.ПланПроизводства	 - обрабатываемый документ
//  СписокКорректировок - ТаблицаЗначений				 - список корректировок
//
Процедура ДобавитьВОчередь(ПланПроизводства, СписокКорректировок) Экспорт
	
	Набор = РегистрыСведений.СодержаниеКорректировокПланаПроизводства.СоздатьНаборЗаписей();
	Набор.Отбор.ПланПроизводства.Установить(ПланПроизводства);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого Строка Из СписокКорректировок Цикл
		
		Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
		Набор.Отбор.Характеристика.Установить(Строка.Характеристика);
		Набор.Отбор.Назначение.Установить(Строка.Назначение);
		Набор.Отбор.ДатаВыпускаПолуфабриката.Установить(Строка.ДатаВыпускаПолуфабриката);
		
		НоваяЗапись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Строка);
		
		Набор.Записать(Истина);
		
		Набор.Очистить();
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Очищает очередь корректировок по плану производства.
//
// Параметры:
//  ПланПроизводства - ДокументСсылка.ПланПроизводства	 - обрабатываемый документ
//
Процедура ОчиститьОчередь(ПланПроизводства) Экспорт
	
	Набор = РегистрыСведений.СодержаниеКорректировокПланаПроизводства.СоздатьНаборЗаписей();
	Набор.Отбор.ПланПроизводства.Установить(ПланПроизводства);
	
	УстановитьПривилегированныйРежим(Истина);
	Набор.Записать(Истина);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Очищает очередь корректировок по плану производства.
//
// Параметры:
//  ПланПроизводства	 - ДокументСсылка.ПланПроизводства	 - обрабатываемый документ
//  СписокКорректировок	 - Массив, ТаблицаЗначений			 - список корректировок
//
Процедура ОтметитьВыполнение(ПланПроизводства, СписокКорректировок) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СписокКорректировок) Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.СодержаниеКорректировокПланаПроизводства.СоздатьНаборЗаписей();
	Набор.Отбор.ПланПроизводства.Установить(ПланПроизводства);
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого Строка Из СписокКорректировок Цикл
		
		Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
		Набор.Отбор.Характеристика.Установить(Строка.Характеристика);
		Набор.Отбор.Назначение.Установить(Строка.Назначение);
		Набор.Отбор.ДатаВыпускаПолуфабриката.Установить(Строка.ДатаВыпускаПолуфабриката);
		
		Набор.Записать(Истина);
		
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
